; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob78) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - pallet
	crate0 crate1 crate2 crate3 crate4 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear crate2)
	(at pallet9 depot0)
	(clear crate1)
	(at pallet10 distributor2)
	(clear crate0)
	(at pallet11 distributor2)
	(clear crate4)
	(at pallet12 depot2)
	(clear crate3)
	(at pallet13 distributor0)
	(clear pallet13)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 321)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 336)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet10)
	(= (weight crate0) 99)
	(at crate1 depot0)
	(on crate1 pallet9)
	(= (weight crate1) 56)
	(at crate2 distributor2)
	(on crate2 pallet8)
	(= (weight crate2) 84)
	(at crate3 depot2)
	(on crate3 pallet12)
	(= (weight crate3) 60)
	(at crate4 distributor2)
	(on crate4 pallet11)
	(= (weight crate4) 53)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet10)
		(on crate1 crate4)
		(on crate2 pallet6)
		(on crate4 crate2)
	)
)

(:metric minimize (total-time)))

; plan
1. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 0 to 10
   goals met: 1 of 4
2. (lift hoist0 crate1 pallet9 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet9)
   added: (lifting hoist0 crate1) (clear pallet9)
   changed: (fuel-cost) from 10 to 11
   goals met: 1 of 4
3. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 56
   goals met: 1 of 4
4. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 11 to 21
   goals met: 1 of 4
5. (lift hoist5 crate4 pallet11 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 pallet11)
   added: (lifting hoist5 crate4) (clear pallet11)
   changed: (fuel-cost) from 21 to 22
   goals met: 1 of 4
6. (drop hoist5 crate4 crate2 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate2)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate2)
   goals met: 2 of 4
7. (lift hoist5 crate4 crate2 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 crate2)
   added: (lifting hoist5 crate4) (clear crate2)
   changed: (fuel-cost) from 22 to 23
   goals met: 1 of 4
8. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   changed: (current_load truck0) from 56 to 109
   goals met: 1 of 4
9. (lift hoist5 crate2 pallet8 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet8)
   added: (lifting hoist5 crate2) (clear pallet8)
   changed: (fuel-cost) from 23 to 24
   goals met: 1 of 4
10. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   changed: (current_load truck0) from 109 to 193
   goals met: 1 of 4
11. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 24 to 34
   goals met: 1 of 4
12. (unload hoist2 crate2 truck0 depot2)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 193 to 109
   goals met: 1 of 4
13. (drop hoist2 crate2 crate3 depot2)
   deleted: (lifting hoist2 crate2) (clear crate3)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 crate3)
   goals met: 1 of 4
14. (unload hoist2 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 109 to 56
   goals met: 1 of 4
15. (drop hoist2 crate4 crate2 depot2)
   deleted: (lifting hoist2 crate4) (clear crate2)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 crate2)
   goals met: 2 of 4
16. (lift hoist2 crate4 crate2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate2)
   added: (lifting hoist2 crate4) (clear crate2)
   changed: (fuel-cost) from 34 to 35
   goals met: 1 of 4
17. (load hoist2 crate4 truck0 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 56 to 109
   goals met: 1 of 4
18. (lift hoist2 crate2 crate3 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 crate3)
   added: (lifting hoist2 crate2) (clear crate3)
   changed: (fuel-cost) from 35 to 36
   goals met: 1 of 4
19. (drop hoist2 crate2 pallet6 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet6)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 pallet6)
   goals met: 2 of 4
20. (unload hoist2 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 109 to 56
   goals met: 2 of 4
21. (drop hoist2 crate4 crate2 depot2)
   deleted: (lifting hoist2 crate4) (clear crate2)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 crate2)
   goals met: 3 of 4
22. (unload hoist2 crate1 truck0 depot2)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 56 to 0
   goals met: 3 of 4
23. (drop hoist2 crate1 crate4 depot2)
   deleted: (lifting hoist2 crate1) (clear crate4)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 crate4)
   goals met: 4 of 4
